ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
/* Wheel sync: per-wheel PID keeps each wheel near TARGET_RPM independently,
 * but confirmed live (2026-07-27) that's not enough - robot pulls right,
 * would circle if left running. Small per-cycle differences between the two
 * (different motors, different overshoot/settling) add up over time into
 * real position drift. This trims each wheel's target RPM based on TOTAL
 * distance traveled so far (cumulative pulses, never reset), not just
 * instantaneous RPM - a wheel that's fallen behind gets sped up until it
 * actually catches up, not just "goes the same speed from now on".
 * KSYNC=0.05 is a conservative starting guess, same philosophy as Kp/Ki.
 * Gated 2026-07-27 (F5): only active while /cmd_vel's angular.z is near
 * zero (straight-line driving) - an intentional turn deliberately makes the
 * two wheels travel different distances, and without this gate the sync
 * logic would fight every turn command, trying to "correct" a difference
 * that was never a mistake. See STRAIGHT_ANGULAR_THRESHOLD below. */
#define KSYNC 0.05f
#define MAX_SYNC_TRIM 15.0f   /* clamp: don't let sync fighting dominate over the base target */

/* --- F4: odometry (measured 2026-07-27: wheel diameter 6cm, wheelbase 10cm) ---
 * distance per pulse = wheel circumference / slots per rev - converts a raw
 * pulse count directly into linear distance traveled by that wheel.
 * Differential-drive kinematics: center-of-robot distance is the AVERAGE of
 * the two wheels' distances (if both go the same distance, robot moves
 * straight with no turn); heading change is the DIFFERENCE divided by the
 * wheelbase (if right travels further than left, robot rotates toward the
 * left/slower side - matches the direction convention already confirmed
 * earlier today: faster right wheel -> drifts left). */
#define WHEEL_DIAMETER_M 0.06f
#define WHEELBASE_M 0.10f
#define PI_F 3.14159265f   /* not relying on M_PI - not guaranteed defined by every libc without _USE_MATH_DEFINES */
#define WHEEL_CIRCUMFERENCE_M (PI_F * WHEEL_DIAMETER_M)
#define DISTANCE_PER_PULSE_M (WHEEL_CIRCUMFERENCE_M / SLOTS_PER_REV)

/* --- F5: /cmd_vel in, /odom out (2026-07-27) ---
 * Safety default: if no /cmd_vel received within this long (agent crash,
 * USB unplugged, Jetson down), treat commanded velocity as 0 rather than
 * keep driving on the last command received - a lost connection must mean
 * "stop", never "keep going blind". Applies both before the first command
 * ever arrives AND if a live connection drops mid-drive. */
#define CMD_VEL_TIMEOUT_US 1000000   /* 1s */

/* Below this |angular.z|, treat the commanded motion as "going straight" for
 * wheel-sync purposes (see KSYNC comment above) - not exactly 0 because a
 * genuinely-straight command from ros2/Nav2 may carry tiny floating-point
 * noise rather than a clean 0.0. */
#define STRAIGHT_ANGULAR_THRESHOLD 0.05f   /* rad/s */

#define ODOM_PUBLISH_PERIOD_MS 100   /* 10 Hz */

static const char *TAG = "control_task";

/* Shared between ISR (writer) and control_task (reader) -> must be volatile
 * so the compiler never caches a stale copy in a register. */
static volatile uint32_t pulse_count_left = 0;
static volatile uint32_t pulse_count_right = 0;

/* Latest computed RPM, exposed for uros_task (F5) to read later. */
static volatile float rpm_left_shared = 0.0f;
static volatile float rpm_right_shared = 0.0f;

/* F5: /cmd_vel, written by uros_task's subscription callback, read by
 * control_task. last_cmd_vel_us is the watchdog clock - see
 * CMD_VEL_TIMEOUT_US comment above. */
static volatile float cmd_linear_x = 0.0f;
static volatile float cmd_angular_z = 0.0f;
static volatile int64_t last_cmd_vel_us = 0;

/* F5: pose + velocity, written by control_task (F4 odometry math), read by
 * uros_task to publish /odom. Plain floats (not the mutex-protected pulse
 * counters) - a torn read here would be a stale/slightly-off reading, not a
 * silently-corrupted control decision, so it's not worth the locking. */
static volatile float pose_x_shared = 0.0f;
static volatile float pose_y_shared = 0.0f;
static volatile float pose_theta_shared = 0.0f;
static volatile float linear_vel_shared = 0.0f;
static volatile float angular_vel_shared = 0.0f;

/* Added for hardware debugging (Alex, one-wheel-not-spinning investigation):
 * applied_pwm_left/right were previously local-only to control_task, so
 * uros_task had no way to report them. Mirrors the rpm_*_shared pattern
 * above. */
static volatile float pwm_left_shared = 0.0f;
static volatile float pwm_right_shared = 0.0f;

/* Gyro-Z heading fusion (2026-08-22), written by uros_task's existing IMU
 * read, read by control_task - same cross-task pattern as rpm_*_shared
 * above. imu_gz_valid_shared is false whenever the most recent read failed
 * (IMU never woke, or the ~20s-uptime read-degradation bug latched imu_dev
 * dead for this boot - see README "Lessons Learned") so control_task can
 * always fail safe back to the original encoder-differential dtheta
 * instead of blending in a stale/garbage gyro value. */
static volatile float imu_gz_rad_per_s_shared = 0.0f;
static volatile bool imu_gz_valid_shared = false;

/* Spinlock used to make "read + reset" atomic (avoids the lost-pulse race
 * where a pulse arrives between reading the counter and zeroing it). */
static portMUX_TYPE encoder_mux = portMUX_INITIALIZER_UNLOCKED;

/* Debounce: while the motor is actually running (not hand-spun), PWM
 * switching edges and DC-brush arcing couple electrical noise onto the
 * encoder signal line, which the ISR was counting as real slot transitions
 * (confirmed 2026-07-27: hand-spinning gave clean 0-60 RPM, motor-running
 * gave RPM spiking as high as 6300). Reject edges that arrive faster than
 * any real slot transition physically could - at TARGET_RPM=30 the real
 * interval is ~100ms, so there's large margin to push this threshold up.
 * 3ms wasn't enough (tested 2026-07-27: cut peak noise from RPM=6300 down
 * to RPM=540, but R still noisy vs. L's clean 0/60) - PWM runs at 1kHz
 * (1ms period), so switching noise can recur faster than a 3ms window
 * rejects. Raised to 15ms, still >>3x below the real ~50ms interval. */
#define MIN_PULSE_INTERVAL_US 15000

static volatile int64_t last_edge_us_left = 0;
static volatile int64_t last_edge_us_right = 0;

/* 2026-07-27, after fixing a bad encoder solder joint: with clean pulses,
 * RPM was still visibly jumping in fixed steps (0, 15, 30, 45...) with no
 * in-between values. Root cause: counting whole pulses in a fixed 200ms
 * window can only ever measure in units of "1 pulse / window" = 15 RPM -
 * a motor spinning at, say, 22 RPM is invisible to that method. Fixed by
 * also recording the time BETWEEN consecutive pulses (`last_interval_us`),
 * so control_task can compute RPM from timing instead of counting - the
 * standard "period measurement" tachometer technique, far finer resolution
 * at low speed than "frequency measurement" (pulse-counting) gives. */
static volatile int64_t last_interval_us_left = 0;
static volatile int64_t last_interval_us_right = 0;

