ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
typedef struct {
    volatile uint32_t *counter;
    volatile int64_t *last_edge_us;
    volatile int64_t *last_interval_us;
} encoder_isr_arg_t;

static encoder_isr_arg_t enc_left_arg  = { &pulse_count_left,  &last_edge_us_left,  &last_interval_us_left };
static encoder_isr_arg_t enc_right_arg = { &pulse_count_right, &last_edge_us_right, &last_interval_us_right };

/* One ISR handles both pins; `arg` tells it which counter/debounce-clock to use.
 * IRAM_ATTR: ISR code must live in IRAM so it still runs even while
 * flash cache is temporarily disabled (standard ESP-IDF requirement).
 * esp_timer_get_time() is documented safe to call from ISR context. */
static void IRAM_ATTR encoder_isr_handler(void *arg) {
    encoder_isr_arg_t *a = (encoder_isr_arg_t *)arg;
    int64_t now = esp_timer_get_time();
    int64_t since_last = now - *(a->last_edge_us);

    if (since_last < MIN_PULSE_INTERVAL_US) {
        return;   /* too soon to be a real slot transition - noise, drop it */
    }
    *(a->last_interval_us) = since_last;
    *(a->last_edge_us) = now;
    (*(a->counter))++;   /* only this otherwise. No math, no logging, no delays in an ISR. */
}

static void encoder_gpio_init(void) {
    gpio_config_t io_conf = {
        .pin_bit_mask = (1ULL << ENC_L_PIN) | (1ULL << ENC_R_PIN),
        .mode = GPIO_MODE_INPUT,
        /* GPIO34/35 are input-only pins anyway (can't drive internal
         * pull-up/down), and the LM393 module already has its own. */
        .pull_up_en = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type = GPIO_INTR_POSEDGE,   /* rising edge only */
    };
    ESP_ERROR_CHECK(gpio_config(&io_conf));

    gpio_install_isr_service(0);
    gpio_isr_handler_add(ENC_L_PIN, encoder_isr_handler, (void *)&enc_left_arg);
    gpio_isr_handler_add(ENC_R_PIN, encoder_isr_handler, (void *)&enc_right_arg);
}

/* Raised to the true hardware ceiling 2026-08-24: confirmed live that PID
 * was maxing out at the old 100/200 cap (out of the LEDC's real 0-255
 * range) with RPM still reading 0 - wheels needed more than that to
 * overcome stall/friction, so the cap itself was the blocker, not a real
 * mechanical problem. VM has had its own dedicated powerbank wire since
 * 2026-07-24 (see README "Power Architecture"), so the original brownout
 * concern this cap was guarding against doesn't apply. No ceiling below
 * hardware max anymore - this bound only exists so a PID overshoot can't
 * cast a value above 255 into the uint32_t duty (undefined/wraps), not to
 * limit real power. */
#define MAX_SAFE_PWM 255.0f

/* No floor as of 2026-08-24 - confirmed the powerbank no longer needs the
 * artificial minimum current draw the old 10.0f floor existed for. True 0
 * is now reachable, so the robot can actually sit fully silent/still
 * instead of a constant faint motor whine at idle. That whine's real cause
 * (never fully root-caused, see README "Lessons Learned"): target_rpm
 * reaching pid_step() as a tiny non-zero float instead of bit-exact 0.0f
 * (e.g. from sync_trim) skips the target_rpm==0.0f bypass above and used
 * to fall through to this floor. Setting the floor itself to 0 removes
 * that symptom too, not just this constant's original intended case - the
 * lower bound stays here (not removed outright) purely so a negative `u`
 * can't underflow the uint32_t cast below, same reasoning as the ceiling. */
#define MIN_SAFE_PWM 0.0f

/* error(t) = target - actual; u(t) = Kp*error(t) + Ki*integral(t);
 * PWM = clamp(u(t), MIN_SAFE_PWM, MAX_SAFE_PWM). `integral` is per-wheel
 * state owned by the caller (control_task) since left/right run independent
 * loops - it persists across calls, unlike everything else in here.
 *
 * BUG FOUND 2026-07-27 (F5 first test): MIN_SAFE_PWM was clamping the
 * output even when target_rpm==0 - the F5 safety watchdog forces target
 * to 0 on a stale/missing /cmd_vel, but the floor was overriding that,
 * so the robot never actually stopped (kept driving on no command at all,
 * confirmed live - x drifted past 2m unattended). Explicit target==0
 * bypass added below: a commanded stop means PWM=0, full stop, no floor -
 * the floor only makes sense while the robot is supposed to be moving.
 * Also resets the integral so a long stop doesn't leave stale windup to
 * bias the next real command. */
static uint32_t pid_step(float target_rpm, float actual_rpm, float *integral) {
    if (target_rpm == 0.0f) {
        *integral = 0.0f;
        return 0;
    }

    float error = target_rpm - actual_rpm;
    float dt = CONTROL_PERIOD_MS / 1000.0f;

    *integral += error * dt;
    if (*integral > MAX_INTEGRAL)  *integral = MAX_INTEGRAL;   /* anti-windup clamp, see MAX_INTEGRAL comment */
    if (*integral < -MAX_INTEGRAL) *integral = -MAX_INTEGRAL;

    float u = KP * error + KI * (*integral);

    if (u < MIN_SAFE_PWM)   u = MIN_SAFE_PWM;   /* clamp: floor keeps current draw above the powerbank's auto-shutoff threshold */
    if (u > MAX_SAFE_PWM)   u = MAX_SAFE_PWM;   /* clamp: temporary current-safety ceiling, not the LEDC max */

    return (uint32_t)u;
}

/* Caps how much the applied PWM can change in one cycle, regardless of how
 * big a jump pid_step() wants. This limits di/dt on the shared power rail —
 * a sudden PWM jump stresses a marginal supply harder than the same
 * steady-state current reached gradually. Does not replace the VM rewire;
 * it reduces (not eliminates) brownout risk while that's still pending. */
#define MAX_PWM_STEP_PER_CYCLE 10.0f

static float slew_limit(float applied, float target) {
    if (target > applied + MAX_PWM_STEP_PER_CYCLE) return applied + MAX_PWM_STEP_PER_CYCLE;
    if (target < applied - MAX_PWM_STEP_PER_CYCLE) return applied - MAX_PWM_STEP_PER_CYCLE;
    return target;
}

/* Encoder read + PID + PWM write, all in ONE task/cycle — replaces the old
 * separate encoder_task (1 Hz) + pid_task (100 Hz). That split meant PID
 * recomputed 100x/sec against an RPM value that was up to 1 full second
 * stale. Running both halves in the same 20 Hz loop means PID always acts
 * on the reading from THIS cycle — zero cross-task staleness.
 * (CONTROL_PERIOD_MS itself now lives up near SLOTS_PER_REV - pid_step()
 * needs it too, and #define order matters in C.) */

/* Companion to the period-measurement RPM calc above: period measurement
 * alone can't distinguish "stopped" from "just hasn't ticked yet" - without
 * a timeout it would keep reporting the last (increasingly stale) interval
 * forever after the wheel actually stops. If no new pulse arrives within
 * this long, treat RPM as 0 instead. ~500ms is generous margin (~10x) over
 * the ~50ms/pulse interval expected near TARGET_RPM=60. */
#define RPM_STALE_US 500000

/* Silent-failure guard: if PWM is clearly high enough to move the wheel but
 * pulse count stays 0 for this many consecutive cycles, the encoder is
 * almost certainly dead (misaligned, unglued, wiring fault) rather than the
 * wheel legitimately being stopped. 20 cycles = 4s at 5Hz (was 1s at the old
 * 20Hz) — one slot alone only needs ~100ms at TARGET_RPM, so this still has
 * generous margin against false positives from startup transients. */
#define STALL_PWM_THRESHOLD 30.0f
#define STALL_CYCLE_LIMIT   20

static void control_task(void *arg) {
    encoder_gpio_init();

    uint32_t snapshot_left, snapshot_right;
    float applied_pwm_left = 0.0f, applied_pwm_right = 0.0f;
    float integral_left = 0.0f, integral_right = 0.0f;
    uint32_t total_pulses_left = 0, total_pulses_right = 0;
    uint32_t stall_cycles_left = 0, stall_cycles_right = 0;
    /* F4 pose lives in pose_x_shared/pose_y_shared/pose_theta_shared now
     * (F5 needs uros_task to read it) - origin = wherever the robot is at
     * boot/flash, all initialized 0 at file scope. */
    TickType_t last_wake = xTaskGetTickCount();
    const TickType_t period = pdMS_TO_TICKS(CONTROL_PERIOD_MS);

    while (1) {
        vTaskDelayUntil(&last_wake, period);

        int64_t now = esp_timer_get_time();
        int64_t last_edge_left, last_edge_right, interval_left, interval_right;

        portENTER_CRITICAL(&encoder_mux);
        snapshot_left = pulse_count_left;
        pulse_count_left = 0;
        snapshot_right = pulse_count_right;
        pulse_count_right = 0;
        /* int64_t isn't atomic on a 32-bit MCU (two word-writes) - read these
         * inside the same critical section as the pulse counts to avoid a
         * torn read racing the ISR mid-update. */
        last_edge_left   = last_edge_us_left;
        last_edge_right  = last_edge_us_right;
        interval_left    = last_interval_us_left;
        interval_right   = last_interval_us_right;
        portEXIT_CRITICAL(&encoder_mux);

