ChuoiUhuhu0727/slam-amr/esp32/motor_f1/main/motor_f1.c
        rclc_executor_t *exec = &executor;
        rclc_executor_init(exec, &support.context, 1, &allocator);
        rclc_executor_add_subscription(exec, &cmd_vel_sub, &cmd_vel_msg, &cmd_vel_callback, ON_NEW_DATA);

        /* diag_text's CONTENT is now rebuilt every publish cycle (see the
         * publish block below) so /esp32_diag carries live per-wheel
         * RPM/PWM, not just the reset reason from connection time. The
         * buffer pointer/capacity themselves don't change per-message, so
         * only need to be set once here. */
        diag_msg.data.data = diag_text;
        diag_msg.data.capacity = sizeof(diag_text);
        imu_msg.data.data = imu_text;
        imu_msg.data.capacity = sizeof(imu_text);

        /* Set once - frame_id strings don't change per-message, only the
         * numeric fields below do. */
        odom_msg.header.frame_id.data = "odom";
        odom_msg.header.frame_id.size = strlen("odom");
        odom_msg.header.frame_id.capacity = odom_msg.header.frame_id.size + 1;
        odom_msg.child_frame_id.data = "base_link";
        odom_msg.child_frame_id.size = strlen("base_link");
        odom_msg.child_frame_id.capacity = odom_msg.child_frame_id.size + 1;

        TickType_t last_publish = xTaskGetTickCount();
        const TickType_t publish_period = pdMS_TO_TICKS(ODOM_PUBLISH_PERIOD_MS);
        bool agent_ok = true;

        while (agent_ok) {
            rclc_executor_spin_some(exec, RCL_MS_TO_NS(20));

            if (xTaskGetTickCount() - last_publish >= publish_period) {
                last_publish = xTaskGetTickCount();

                odom_msg.pose.pose.position.x = pose_x_shared;
                odom_msg.pose.pose.position.y = pose_y_shared;
                odom_msg.pose.pose.position.z = 0.0;

                /* Orientation as a quaternion, rotation about Z only (2D
                 * robot) - qz=sin(theta/2), qw=cos(theta/2), qx=qy=0. */
                float half_theta = pose_theta_shared / 2.0f;
                odom_msg.pose.pose.orientation.x = 0.0;
                odom_msg.pose.pose.orientation.y = 0.0;
                odom_msg.pose.pose.orientation.z = sinf(half_theta);
                odom_msg.pose.pose.orientation.w = cosf(half_theta);

                odom_msg.twist.twist.linear.x  = linear_vel_shared;
                odom_msg.twist.twist.angular.z = angular_vel_shared;

                if (rcl_publish(&odom_pub, &odom_msg, NULL) != RCL_RET_OK) {
                    agent_ok = false;
                }

                /* Rebuilt every cycle now (see comment above) - live
                 * per-wheel RPM/PWM for hardware debugging, since
                 * idf.py monitor is unusable once this transport owns
                 * UART0 (see note above cmd_vel_callback). */
                snprintf(diag_text, sizeof(diag_text),
                         "reset=%s RPM L=%.1f R=%.1f PWM L=%.0f R=%.0f I2C=%s WAKE=%d",
                         reset_reason_str(g_reset_reason),
                         rpm_left_shared, rpm_right_shared,
                         pwm_left_shared, pwm_right_shared,
                         g_i2c_scan_result, g_imu_wake_attempts);
                diag_msg.data.size = strlen(diag_text);

                if (rcl_publish(&diag_pub, &diag_msg, NULL) != RCL_RET_OK) {
                    agent_ok = false;
                }

                /* IMU sanity-check read (2026-08-14) - done inline here
                 * rather than in its own task: I2C at 400kHz for 14 bytes
                 * is on the order of tens of microseconds, negligible next
                 * to this loop's 100ms period, and doing it in-line means
                 * no shared volatile state and no ISR/task race to reason
                 * about at all - unlike pulse_count_left/right, which DO
                 * cross a real task boundary and need portENTER_CRITICAL. */
                int16_t imu_ax, imu_ay, imu_az, imu_gx, imu_gy, imu_gz;
                if (imu_read_raw(&imu_ax, &imu_ay, &imu_az,
                                  &imu_gx, &imu_gy, &imu_gz)) {
                    snprintf(imu_text, sizeof(imu_text),
                             "ax=%d ay=%d az=%d gx=%d gy=%d gz=%d",
                             imu_ax, imu_ay, imu_az, imu_gx, imu_gy, imu_gz);
                    /* gz <-> robot Z (yaw), empirically confirmed 2026-08-22:
                     * positive gz = turning left (CCW from above), matching
                     * control_task's existing encoder-differential dtheta
                     * sign exactly - no sign flip needed. */
                    imu_gz_rad_per_s_shared = (float)imu_gz * GYRO_RAW_TO_RAD_PER_S;
                    imu_gz_valid_shared = true;
                } else {
                    snprintf(imu_text, sizeof(imu_text), "imu_read_failed");
                    imu_gz_valid_shared = false;
                }
                imu_msg.data.size = strlen(imu_text);
                if (rcl_publish(&imu_pub, &imu_msg, NULL) != RCL_RET_OK) {
                    agent_ok = false;
                }
            }

            /* BUG FOUND 2026-07-27 (F5 first connectivity test): timeout=0
             * gives the ping response no time to actually arrive over the
             * UART round-trip, so it reported "failed" almost every cycle
             * even with the agent alive and working - confirmed live as a
             * connect/create-everything/disconnect loop every ~1-2s, right
             * after all the ROS entities were successfully created. 100ms
             * is generous for a serial round-trip without blocking the
             * executor/publish loop for long. */
            if (rmw_uros_ping_agent(100, 1) != RMW_RET_OK) {
                agent_ok = false;
            }
            vTaskDelay(pdMS_TO_TICKS(20));
        }

        if (rcl_publisher_fini(&imu_pub, &node) != RCL_RET_OK) {}
        if (rcl_publisher_fini(&diag_pub, &node) != RCL_RET_OK) {}
        if (rcl_publisher_fini(&odom_pub, &node) != RCL_RET_OK) {}
        if (rcl_subscription_fini(&cmd_vel_sub, &node) != RCL_RET_OK) {}
        if (rclc_executor_fini(exec) != RCL_RET_OK) {}
        if (rcl_node_fini(&node) != RCL_RET_OK) {}
        rclc_support_fini(&support);
        vTaskDelay(pdMS_TO_TICKS(1000));
    }
}

/* Configure the five direction/enable pins as digital outputs. */
static void setup_gpio(void) {
    gpio_config_t cfg = {
        .pin_bit_mask = (1ULL << AIN1_PIN) | (1ULL << AIN2_PIN) |
                        (1ULL << BIN1_PIN) | (1ULL << BIN2_PIN) |
                        (1ULL << STBY_PIN),
        .mode = GPIO_MODE_OUTPUT,
    };
    ESP_ERROR_CHECK(gpio_config(&cfg));
}

/* Configure the LEDC hardware to generate PWM on PWMA and PWMB.
 * LEDC does the fast HIGH/LOW switching in hardware, so app_main never
 * has to toggle the pin itself. */
static void setup_pwm(void) {
    ledc_timer_config_t timer = {
        .speed_mode      = LEDC_HIGH_SPEED_MODE,
        .duty_resolution = LEDC_TIMER_8_BIT,   /* duty range 0..255 */
        .timer_num       = LEDC_TIMER_0,
        .freq_hz         = PWM_FREQ_HZ,
        .clk_cfg         = LEDC_AUTO_CLK,
    };
    ESP_ERROR_CHECK(ledc_timer_config(&timer));

